## Plan Result (prod-global)




<pre><code>Plan: 2 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;plum&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;plum&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod"
        name                                         = "hmcts-prod"
        tags                                         = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (14 unchanged attributes hidden)

      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-div-dn" -> "healthProbeSettings-plum"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/div-dn"
          ~ load_balancing_name = "loadBalancingSettings-div-dn" -> "loadBalancingSettings-plum"
          ~ name                = "div-dn" -> "plum"

          ~ backend {
              ~ host_header = "www.decree-nisi.apply-divorce.service.gov.uk" -> "plum.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-div-da" -> "healthProbeSettings-div-dn"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/div-da"
          ~ load_balancing_name = "loadBalancingSettings-div-da" -> "loadBalancingSettings-div-dn"
          ~ name                = "div-da" -> "div-dn"

          ~ backend {
              ~ host_header = "www.decree-absolute.apply-divorce.service.gov.uk" -> "www.decree-nisi.apply-divorce.service.gov.uk"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-div-rfe" -> "healthProbeSettings-div-da"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/div-rfe"
          ~ load_balancing_name = "loadBalancingSettings-div-rfe" -> "loadBalancingSettings-div-da"
          ~ name                = "div-rfe" -> "div-da"

          ~ backend {
              ~ host_header = "www.respond-divorce.service.gov.uk" -> "www.decree-absolute.apply-divorce.service.gov.uk"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-div-pfe" -> "healthProbeSettings-div-rfe"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/div-pfe"
          ~ load_balancing_name = "loadBalancingSettings-div-pfe" -> "loadBalancingSettings-div-rfe"
          ~ name                = "div-pfe" -> "div-rfe"

          ~ backend {
              ~ host_header = "www.apply-divorce.service.gov.uk" -> "www.respond-divorce.service.gov.uk"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-div-amend" -> "healthProbeSettings-div-pfe"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/div-amend"
          ~ load_balancing_name = "loadBalancingSettings-div-amend" -> "loadBalancingSettings-div-pfe"
          ~ name                = "div-amend" -> "div-pfe"

          ~ backend {
              ~ host_header = "www.manage-application.apply-divorce.service.gov.uk" -> "www.apply-divorce.service.gov.uk"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-nfdiv-civil-partnership" -> "healthProbeSettings-div-amend"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/nfdiv-civil-partnership"
          ~ load_balancing_name = "loadBalancingSettings-nfdiv-civil-partnership" -> "loadBalancingSettings-div-amend"
          ~ name                = "nfdiv-civil-partnership" -> "div-amend"

          ~ backend {
              ~ host_header = "www.end-civil-partnership.service.gov.uk" -> "www.manage-application.apply-divorce.service.gov.uk"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-sscs-tribunals" -> "healthProbeSettings-nfdiv-civil-partnership"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/sscs-tribunals"
          ~ load_balancing_name = "loadBalancingSettings-sscs-tribunals" -> "loadBalancingSettings-nfdiv-civil-partnership"
          ~ name                = "sscs-tribunals" -> "nfdiv-civil-partnership"

          ~ backend {
              ~ host_header = "www.appeal-benefit-decision.service.gov.uk" -> "www.end-civil-partnership.service.gov.uk"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-sscs-tya" -> "healthProbeSettings-sscs-tribunals"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/sscs-tya"
          ~ load_balancing_name = "loadBalancingSettings-sscs-tya" -> "loadBalancingSettings-sscs-tribunals"
          ~ name                = "sscs-tya" -> "sscs-tribunals"

          ~ backend {
              ~ host_header = "www.track-benefit-appeal.service.gov.uk" -> "www.appeal-benefit-decision.service.gov.uk"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-sscs-cor" -> "healthProbeSettings-sscs-tya"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/sscs-cor"
          ~ load_balancing_name = "loadBalancingSettings-sscs-cor" -> "loadBalancingSettings-sscs-tya"
          ~ name                = "sscs-cor" -> "sscs-tya"

          ~ backend {
              ~ host_header = "www.manage.appeal-benefit-decision.service.gov.uk" -> "www.track-benefit-appeal.service.gov.uk"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-xui-webapp" -> "healthProbeSettings-sscs-cor"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/xui-webapp"
          ~ load_balancing_name = "loadBalancingSettings-xui-webapp" -> "loadBalancingSettings-sscs-cor"
          ~ name                = "xui-webapp" -> "sscs-cor"

          ~ backend {
              ~ host_header = "manage-case.platform.hmcts.net" -> "www.manage.appeal-benefit-decision.service.gov.uk"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-xui-manage-org" -> "healthProbeSettings-xui-webapp"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/xui-manage-org"
          ~ load_balancing_name = "loadBalancingSettings-xui-manage-org" -> "loadBalancingSettings-xui-webapp"
          ~ name                = "xui-manage-org" -> "xui-webapp"

          ~ backend {
              ~ host_header = "manage-org.platform.hmcts.net" -> "manage-case.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-xui-approve-org" -> "healthProbeSettings-xui-manage-org"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/xui-approve-org"
          ~ load_balancing_name = "loadBalancingSettings-xui-approve-org" -> "loadBalancingSettings-xui-manage-org"
          ~ name                = "xui-approve-org" -> "xui-manage-org"

          ~ backend {
              ~ host_header = "administer-orgs.platform.hmcts.net" -> "manage-org.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-xui-register-org" -> "healthProbeSettings-xui-approve-org"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/xui-register-org"
          ~ load_balancing_name = "loadBalancingSettings-xui-register-org" -> "loadBalancingSettings-xui-approve-org"
          ~ name                = "xui-register-org" -> "xui-approve-org"

          ~ backend {
              ~ host_header = "register-org.platform.hmcts.net" -> "administer-orgs.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-cmc" -> "healthProbeSettings-xui-register-org"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/cmc"
          ~ load_balancing_name = "loadBalancingSettings-cmc" -> "loadBalancingSettings-xui-register-org"
          ~ name                = "cmc" -> "xui-register-org"

          ~ backend {
              ~ host_header = "www.moneyclaims.service.gov.uk" -> "register-org.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-cmc-legal" -> "healthProbeSettings-cmc"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/cmc-legal"
          ~ load_balancing_name = "loadBalancingSettings-cmc-legal" -> "loadBalancingSettings-cmc"
          ~ name                = "cmc-legal" -> "cmc"

          ~ backend {
              ~ host_header = "www.moneyclaim-legal.platform.hmcts.net" -> "www.moneyclaims.service.gov.uk"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-gateway-ccd" -> "healthProbeSettings-cmc-legal"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/gateway-ccd"
          ~ load_balancing_name = "loadBalancingSettings-gateway-ccd" -> "loadBalancingSettings-cmc-legal"
          ~ name                = "gateway-ccd" -> "cmc-legal"

          ~ backend {
              ~ host_header = "gateway.ccd.platform.hmcts.net" -> "www.moneyclaim-legal.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-return-case-doc-ccd" -> "healthProbeSettings-gateway-ccd"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/return-case-doc-ccd"
          ~ load_balancing_name = "loadBalancingSettings-return-case-doc-ccd" -> "loadBalancingSettings-gateway-ccd"
          ~ name                = "return-case-doc-ccd" -> "gateway-ccd"

          ~ backend {
              ~ host_header = "return-case-doc.ccd.platform.hmcts.net" -> "gateway.ccd.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-probate" -> "healthProbeSettings-return-case-doc-ccd"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/probate"
          ~ load_balancing_name = "loadBalancingSettings-probate" -> "loadBalancingSettings-return-case-doc-ccd"
          ~ name                = "probate" -> "return-case-doc-ccd"

          ~ backend {
              ~ host_header = "www.apply-for-probate.service.gov.uk" -> "return-case-doc.ccd.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-ia-aip" -> "healthProbeSettings-probate"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/ia-aip"
          ~ load_balancing_name = "loadBalancingSettings-ia-aip" -> "loadBalancingSettings-probate"
          ~ name                = "ia-aip" -> "probate"

          ~ backend {
              ~ host_header = "www.appeal-immigration-asylum-decision.service.gov.uk" -> "www.apply-for-probate.service.gov.uk"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-fees-register" -> "healthProbeSettings-ia-aip"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/fees-register"
          ~ load_balancing_name = "loadBalancingSettings-fees-register" -> "loadBalancingSettings-ia-aip"
          ~ name                = "fees-register" -> "ia-aip"

          ~ backend {
              ~ host_header = "fees-register.platform.hmcts.net" -> "www.appeal-immigration-asylum-decision.service.gov.uk"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-paybubble" -> "healthProbeSettings-fees-register"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/paybubble"
          ~ load_balancing_name = "loadBalancingSettings-paybubble" -> "loadBalancingSettings-fees-register"
          ~ name                = "paybubble" -> "fees-register"

          ~ backend {
              ~ host_header = "paybubble.platform.hmcts.net" -> "fees-register.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-manage-payments" -> "healthProbeSettings-paybubble"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/manage-payments"
          ~ load_balancing_name = "loadBalancingSettings-manage-payments" -> "loadBalancingSettings-paybubble"
          ~ name                = "manage-payments" -> "paybubble"

          ~ backend {
              ~ host_header = "manage-payments.platform.hmcts.net" -> "paybubble.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-payment-outcome" -> "healthProbeSettings-manage-payments"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/payment-outcome"
          ~ load_balancing_name = "loadBalancingSettings-payment-outcome" -> "loadBalancingSettings-manage-payments"
          ~ name                = "payment-outcome" -> "manage-payments"

          ~ backend {
              ~ host_header = "paymentoutcome-web.platform.hmcts.net" -> "manage-payments.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-idam-web-public" -> "healthProbeSettings-payment-outcome"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/idam-web-public"
          ~ load_balancing_name = "loadBalancingSettings-idam-web-public" -> "loadBalancingSettings-payment-outcome"
          ~ name                = "idam-web-public" -> "payment-outcome"

          ~ backend {
              ~ host_header = "hmcts-access.service.gov.uk" -> "paymentoutcome-web.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-pcq" -> "healthProbeSettings-idam-web-public"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/pcq"
          ~ load_balancing_name = "loadBalancingSettings-pcq" -> "loadBalancingSettings-idam-web-public"
          ~ name                = "pcq" -> "idam-web-public"

          ~ backend {
              ~ host_header = "equality-and-diversity.platform.hmcts.net" -> "hmcts-access.service.gov.uk"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-lau" -> "healthProbeSettings-pcq"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/lau"
          ~ load_balancing_name = "loadBalancingSettings-lau" -> "loadBalancingSettings-pcq"
          ~ name                = "lau" -> "pcq"

          ~ backend {
              ~ host_header = "log-and-audit.platform.hmcts.net" -> "equality-and-diversity.platform.hmcts.net"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-cft-api-mgmt" -> "healthProbeSettings-lau"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/cft-api-mgmt"
          ~ load_balancing_name = "loadBalancingSettings-cft-api-mgmt" -> "loadBalancingSettings-lau"
          ~ name                = "cft-api-mgmt" -> "lau"

          ~ backend {
              ~ address     = "firewall-prod-int-palo-cftapimgmtprod.uksouth.cloudapp.azure.com" -> 

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

aybubbleHttpsRedirect" -> "ia-aipHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "manage-payments",
              + "fees-register",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/manage-paymentsHttpsRedirect"
          ~ name               = "manage-paymentsHttpsRedirect" -> "fees-registerHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "payment-outcome",
              + "paybubble",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/payment-outcomeHttpsRedirect"
          ~ name               = "payment-outcomeHttpsRedirect" -> "paybubbleHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-web-public",
              + "manage-payments",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/idam-web-publicHttpsRedirect"
          ~ name               = "idam-web-publicHttpsRedirect" -> "manage-paymentsHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "pcq",
              + "payment-outcome",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/pcqHttpsRedirect"
          ~ name               = "pcqHttpsRedirect" -> "payment-outcomeHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "lau",
              + "idam-web-public",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/lauHttpsRedirect"
          ~ name               = "lauHttpsRedirect" -> "idam-web-publicHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "cft-api-mgmt",
              + "pcq",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/cft-api-mgmtHttpsRedirect"
          ~ name               = "cft-api-mgmtHttpsRedirect" -> "pcqHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "fact",
              + "lau",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/factHttpsRedirect"
          ~ name               = "factHttpsRedirect" -> "lauHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "fact-admin",
              + "cft-api-mgmt",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/fact-adminHttpsRedirect"
          ~ name               = "fact-adminHttpsRedirect" -> "cft-api-mgmtHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "fact-redirect",
              + "fact",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/fact-redirectHttpsRedirect"
          ~ name               = "fact-redirectHttpsRedirect" -> "factHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "jui-redirect",
              + "fact-admin",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/jui-redirectHttpsRedirect"
          ~ name               = "jui-redirectHttpsRedirect" -> "fact-adminHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-web-admin",
              + "fact-redirect",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/idam-web-adminHttpsRedirect"
          ~ name               = "idam-web-adminHttpsRedirect" -> "fact-redirectHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-user-dashboard",
              + "jui-redirect",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/idam-user-dashboardHttpsRedirect"
          ~ name               = "idam-user-dashboardHttpsRedirect" -> "jui-redirectHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "hmi-apim",
              + "idam-web-admin",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/hmi-apimHttpsRedirect"
          ~ name               = "hmi-apimHttpsRedirect" -> "idam-web-adminHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "reformscan",
              + "idam-user-dashboard",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/reformscanHttpsRedirect"
          ~ name               = "reformscanHttpsRedirect" -> "idam-user-dashboardHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "adoption",
              + "hmi-apim",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/adoptionHttpsRedirect"
          ~ name               = "adoptionHttpsRedirect" -> "hmi-apimHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ accepted_protocols = [
                "Http",
              - "Https",
            ]
          ~ frontend_endpoints = [
              - "wwwfees-register",
              + "reformscan",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/fees-registerwwwRedirect"
          ~ name               = "fees-registerwwwRedirect" -> "reformscanHttpsRedirect"
            # (2 unchanged attributes hidden)

          ~ redirect_configuration {
              - custom_host       = "fees-register.platform.hmcts.net" -> null
                # (2 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
                "Http",
              - "Https",
            ]
          ~ frontend_endpoints = [
              - "wwwpaybubble",
              + "adoption",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/paybubblewwwRedirect"
          ~ name               = "paybubblewwwRedirect" -> "adoptionHttpsRedirect"
            # (2 unchanged attributes hidden)

          ~ redirect_configuration {
              - custom_host       = "paybubble.platform.hmcts.net" -> null
                # (2 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "wwwmanage-payments",
              + "wwwfees-register",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/manage-paymentswwwRedirect"
          ~ name               = "manage-paymentswwwRedirect" -> "fees-registerwwwRedirect"
            # (3 unchanged attributes hidden)

          ~ redirect_configuration {
              ~ custom_host       = "manage-payments.platform.hmcts.net" -> "fees-register.platform.hmcts.net"
                # (2 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "wwwpayment-outcome",
              + "wwwpaybubble",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/payment-outcomewwwRedirect"
          ~ name               = "payment-outcomewwwRedirect" -> "paybubblewwwRedirect"
            # (3 unchanged attributes hidden)

          ~ redirect_configuration {
              ~ custom_host       = "paymentoutcome-web.platform.hmcts.net" -> "paybubble.platform.hmcts.net"
                # (2 unchanged attributes hidden)
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "wwwmanage-payments",
            ]
          + name               = "manage-paymentswwwRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + custom_host       = "manage-payments.platform.hmcts.net"
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "wwwpayment-outcome",
            ]
          + name               = "payment-outcomewwwRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + custom_host       = "paymentoutcome-web.platform.hmcts.net"
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }

        # (6 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["plum"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/frontendEndpoints/plum"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["plum"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "plumprod"
      + resource_group_name   = "lz-prod-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + custom_rule {
          + action                         = "Block"
          + enabled                        = true
          + name                           = "IPMatchWhitelist"
          + priority                       = 1
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "81.134.202.29/32",
                  + "51.145.6.230/32",
                  + "194.33.192.0/25",
                  + "194.33.193.0/25",
                  + "194.33.196.0/25",
                  + "194.33.197.0/25",
                  + "52.210.206.51/32",
                  + "62.25.109.201/32",
                  + "62.25.109.203/32",
                  + "51.143.139.240/32",
                  + "51.145.4.100/32",
                ]
              + match_variable     = "RemoteAddr"
              + negation_condition = true
              + operator           = "IPMatch"
            }
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "iss"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "__auth-token"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "__redirect"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "rf"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "DecodedUrl"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "QueryParamName"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "DecodedPath"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "PostParamName"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "expression"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "GroupName"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "NFuse_Application"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "banner_id"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "callback"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "reply_message_template"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "name"
            }
          + exclusion {
              + match_variable = "RequestHeaderNames"
              + operator       = "Equals"
              + selector       = "User-Agent"
            }
          + exclusion {
              + match_variable = "RequestHeaderNames"
              + operator       = "Equals"
              + selector       = "content-type"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "csvFees"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "description"
            }
        }
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - log {
          - category = "FrontdoorAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1238,"Program":"tfcmt","SHA1":"","Target":"prod-global","Vars":{}} -->